# ; 1 - Напишите программу, которая принимает на вход вещественное число и показывает 
# ; сумму его цифр. Учтите, что числа могут быть отрицательными

# ; Пример:

# ; 67.82 -> 23
# ; (-0.56) -> 11

# number = abs(float(input('Введите вещественное число:\n')))
number = str(input('Введите вещественное число:\n'))
print(number)