# 2 - Напишите программу, которая принимает на вход число N и выдает набор 
# произведений (набор - это список) чисел от 1 до N.
# Не используйте функцию math.factorial.

# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] #(1, 1*2, 1*2*3, 1*2*3*4)

n = int(input('N = '))

def factorial()






# def list_of_products(num):
#     product_list = []
#     for i in range(1, num+1):
#         if i == 1:
#             product_list.append(1)
#         else:
#             product_list.append(i*(i-1))
#     return product_list

# print(list_of_products(n))





# def factorial(num):
#     list_of_products = []
#     if num == 1:
#         list_of_products.append('1')
#     else:
#         list_of_products.append(num*(num - 1))
#     return list_of_products

