# 1 - Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 20 -> [2,5]
# N = 30 -> [2, 3, 5]

from functions import give_int

n = give_int('Введите число:\n')
print(n)
def is_prime(n):
    for i in range(n)
