# ; 1- Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# ; Дополнительно: можете проверить, что это действительно число, и что это действительно входит в нужный диапазон

# ; *Пример:*

# ; - 6 -> да
# ; - 7 -> да
# ; - 1 -> нет

number_of_day = int(input('Введите цифру, обозначающую день недели:\n'))
print(number_of_day)
valid_numbers = [1, 2, 3, 4, 5, 6, 7]